{
 "metadata": {
  "name": ""
 },
 "nbformat": 3,
 "nbformat_minor": 0,
 "worksheets": [
  {
   "cells": [
    {
     "cell_type": "code",
     "collapsed": false,
     "input": [
      "#todo: there is much similarity in _getFriendingUsers _getFollowedUsers _getNotFriendingUsers _getNotFollowedUsers\n",
      "#  consider replacing everything with _getUsers and call it like _getUsers(FRIENDING,true) _getUsers(FOLLOWED,true) _getUsers(FRIENDING,false) _getUsers(FOLLOWED,false)\n",
      "#  once we have among we add _getUsers(AMONG,true) and _getUsers(AMONG,false)\n",
      "\n",
      "#todo change the camel case to snake case\n",
      "\n",
      "class _QueryNode(object):\n",
      "    def __init__(self,*subnodes):\n",
      "        for subnode in subnodes:\n",
      "            if not isinstance(subnode,_QueryNode):\n",
      "                raise Exception(\"And clauses can only contain _QueryNodes\")\n",
      "        self._subnodes=subnodes\n",
      "\n",
      "    #typically inheriting classes will override these methods, often with recursive calls to subnodes\n",
      "    def _getFriendingUsers(self):\n",
      "        return []\n",
      "    def _getFollowedUsers(self):\n",
      "        return []\n",
      "    def _getNotFriendingUsers(self):\n",
      "        return []\n",
      "    def _getNotFollowedUsers(self):\n",
      "        return []\n",
      "\n",
      "class And(_QueryNode):\n",
      "    def __init__(self,*subnodes):\n",
      "        if len(subnodes) < 2:\n",
      "            raise Exception(\"must supply at least 2 clauses to And\")\n",
      "        for subnode in subnodes:\n",
      "            if isinstance(subnode,And):\n",
      "                raise Exception(\"And clauses can not contain And clauses\")\n",
      "            elif not isinstance(subnode,_QueryNode):\n",
      "                raise Exception(\"And clauses can only contain _QueryNodes\")\n",
      "        super(And, self).__init__(*subnodes)\n",
      "        \n",
      "    def _getFriendingUsers(self):\n",
      "        friendingUsers = []\n",
      "        for subNode in self._subnodes:\n",
      "            subFriendingUsers = subNode._getFriendingUsers()\n",
      "            if len(subFriendingUsers)>0:\n",
      "                friendingUsers.extend(subFriendingUsers)\n",
      "        return friendingUsers\n",
      "\n",
      "    def _getFollowedUsers(self):\n",
      "        followedUsers = []\n",
      "        for subNode in self._subnodes:\n",
      "            subFollowedUsers = subNode._getFollowedUsers()\n",
      "            if len(subFollowedUsers)>0:\n",
      "                followedUsers.extend(subFollowedUsers)\n",
      "        return followedUsers\n",
      "    \n",
      "    def _getNotFriendingUsers(self):\n",
      "        notFriendingUsers = []\n",
      "        for subNode in self._subnodes:\n",
      "            subNotFriendingUsers = subNode._getNotFriendingUsers()\n",
      "            if len(subNotFriendingUsers)>0:\n",
      "                notFriendingUsers.extend(subNotFriendingUsers)\n",
      "        return notFriendingUsers\n",
      "\n",
      "    def _getNotFollowedUsers(self):\n",
      "        notFollowedUsers = []\n",
      "        for subNode in self._subnodes:\n",
      "            subNotFollowedUsers = subNode._getNotFollowedUsers()\n",
      "            if len(subNotFollowedUsers)>0:\n",
      "                notFollowedUsers.extend(subNotFollowedUsers)\n",
      "        return notFollowedUsers\n",
      "\n",
      "        \n",
      "class Or(_QueryNode):\n",
      "    def __init__(self,*subnodes):\n",
      "        if len(subnodes) < 2:\n",
      "            raise Exception(\"must supply at least 2 clauses to Or\")\n",
      "        kind = type(subnodes[0])\n",
      "        for subnode in subnodes:\n",
      "            if not isinstance(subnode,(FriendOf,FollowerOf)):\n",
      "                raise Exception(\"Or clauses can only contain FriendOf or FollowerOf clauses\")\n",
      "            if not isinstance(subnode,kind):\n",
      "                raise Exception(\"Or must contain clauses of the SAME type: either FriendOf or FollowerOf\")\n",
      "        super(Or, self).__init__(*subnodes)\n",
      "    \n",
      "    def _getFriendingUsers(self):\n",
      "        friendingUsers = []\n",
      "        for subnode in self._subnodes:\n",
      "            subFriendingUsers = subnode._getFriendingUsers()\n",
      "            if len(subFriendingUsers):\n",
      "                friendingUsers.extend(subFriendingUsers[0])\n",
      "        if len(friendingUsers) > 0:\n",
      "            return [list(set(friendingUsers))]\n",
      "        else:\n",
      "            return []\n",
      "    \n",
      "    def _getFollowedUsers(self):\n",
      "        followedUsers = []\n",
      "        for subnode in self._subnodes:\n",
      "            subFollowedUsers = subnode._getFollowedUsers()\n",
      "            if len(subFollowedUsers):\n",
      "                followedUsers.extend(subFollowedUsers[0])\n",
      "        if len(followedUsers) > 0:\n",
      "            return [list(set(followedUsers))]\n",
      "        else:\n",
      "            return []\n",
      "\n",
      "\n",
      "class FriendOf(_QueryNode):\n",
      "    def __init__(self,*friendingUsers):\n",
      "        if len(friendingUsers) < 1:\n",
      "            raise Exception(\"at least 1 screen name must be specified to FriendOf\")\n",
      "        for user in friendingUsers:\n",
      "            if not isinstance(user,basestring):\n",
      "                raise Exception(\"arguments to FriendOf must be strings\")\n",
      "        self._friendingUsers = list(friendingUsers)\n",
      "        super(FriendOf, self).__init__()\n",
      "\n",
      "    def _getFriendingUsers(self):\n",
      "        return [list(set(self._friendingUsers))]\n",
      "    \n",
      "    \n",
      "class FollowerOf(_QueryNode):\n",
      "    def __init__(self,*followedUsers):\n",
      "        if len(followedUsers) < 1:\n",
      "            raise Exception(\"at least 1 screen name must be specified to FollowerOf\")\n",
      "        for user in followedUsers:\n",
      "            if not isinstance(user,basestring):\n",
      "                raise Exception(\"arguments to FollowerOf must be strings\")\n",
      "        self._followedUsers = list(followedUsers)\n",
      "        super(FollowerOf, self).__init__()\n",
      "\n",
      "    def _getFollowedUsers(self):\n",
      "        return [list(set(self._followedUsers))]\n",
      "\n",
      "class Not(_QueryNode):\n",
      "    def __init__(self,subnode):\n",
      "        print (\"Not is implemented correctly but doesn't have support in the cypher creation of get_users\\n\"\n",
      "               \"see https://github.com/JnBrymn/minglbot/issues/26\")\n",
      "               \n",
      "        if not isinstance(subnode,(FriendOf,FollowerOf,Or)):\n",
      "\t\t\traise Exception(\"Not can only contain FriendOf, FollowerOf, or Or clauses\")\n",
      "        super(Not, self).__init__(subnode)\n",
      "    def _getNotFriendingUsers(self):\n",
      "        return self._subnodes[0]._getFriendingUsers()\n",
      "    def _getNotFollowedUsers(self):\n",
      "        return self._subnodes[0]._getFollowedUsers()\n",
      "\n",
      "class Among(_QueryNode):\n",
      "    def __init__(self,*users):\n",
      "        raise Exception(\"not implemented\")\n",
      "        #Among can be used in Or\n",
      "        #Among can be used in Not\n",
      "        #_getAmongUsers and _getNotAmongUsers must be added\n",
      "        #Only a single Among or NotAmong group can exist at the top level\n",
      "        #The Among and NotAmong can be merged a shorter Among list\n",
      "        "
     ],
     "language": "python",
     "metadata": {},
     "outputs": [],
     "prompt_number": 465
    },
    {
     "cell_type": "code",
     "collapsed": false,
     "input": [
      "import re\n",
      "screen_name_re = re.compile(r\"^\\w+$\")\n",
      "def _escape_user_list(users):\n",
      "    return '[\"'+ '\",\"'.join([user.lower() for user in users if screen_name_re.match(user)]) +'\"]'\n",
      "\n",
      "def get_users(where):\n",
      "    #todo add limit parameter\n",
      "    #todo add possibility for just specifying a list of screen names\n",
      "    #just wrap the screen names in an Among clause and send that to getUsers again\n",
      "    \n",
      "    friendingUsers = where._getFriendingUsers()\n",
      "    followedUsers = where._getFollowedUsers()\n",
      "    notFriendingUsers = where._getNotFriendingUsers()\n",
      "    notFollowedUsers = where._getNotFollowedUsers()\n",
      "    \n",
      "    #add users as necessary to the graph \n",
      "    \n",
      "    #to keep me from fat fingering a mistake later\n",
      "    fr = \"fr\"\n",
      "    fo = \"fo\"\n",
      "    nfr = \"nfr\"\n",
      "    nfo = \"nfo\"\n",
      "    \n",
      "    d={'cypher1':[],'cypher2':[],'group_ids':[]} #this is used to make a modifiable closure variable\n",
      "        \n",
      "    #build and run the query\n",
      "    def make_group_match_cypher(groups,group_id_prefix):\n",
      "        for i,group in enumerate(groups):\n",
      "            group_id = group_id_prefix+str(i)+\"_id\"\n",
      "            user_list = _escape_user_list(group)\n",
      "            group_ids_str = \", \".join(d['group_ids']) + \", \" if len(d['group_ids']) > 0 else \"\"\n",
      "            d['cypher1'].append((\"MATCH (x:User) WHERE x.screen_name IN {user_list}\\n\"\n",
      "                           \"  WITH {group_ids_str}collect(id(x)) AS {group_id}\"\n",
      "                           ).format(user_list=user_list,group_ids_str =group_ids_str,group_id=group_id))\n",
      "            d['group_ids'].append(group_id)\n",
      "            d['cypher2'].append(\"id({0}) IN {1}\".format(group_id_prefix+str(i),group_id))\n",
      "            \n",
      "    \n",
      "    make_group_match_cypher(friendingUsers,fr)\n",
      "    make_group_match_cypher(followedUsers,fo)\n",
      "    make_group_match_cypher(notFriendingUsers,nfr)\n",
      "    make_group_match_cypher(notFollowedUsers,nfo)\n",
      "    \n",
      "    query = \"\\n\\n\".join(d['cypher1'])\n",
      "    query += \"\\n\\nMATCH\\n\"\n",
      "    cypher_clauses = []\n",
      "    for i,group in enumerate(friendingUsers):\n",
      "        group_id = fr+str(i)\n",
      "        cypher_clauses.append(\"  ({group_id})-[:FOLLOWS]->(target)\".format(group_id=group_id))\n",
      "    for i,group in enumerate(followedUsers):\n",
      "        group_id = fo+str(i)\n",
      "        cypher_clauses.append(\"  (target)-[:FOLLOWS]->({group_id})\".format(group_id=group_id))\n",
      "    for i,group in enumerate(notFriendingUsers):\n",
      "        group_id = nfr+str(i)\n",
      "        cypher_clauses.append(\"  ({group_id})\".format(group_id=group_id))\n",
      "    for i,group in enumerate(notFollowedUsers):\n",
      "        group_id = nfo+str(i)\n",
      "        cypher_clauses.append(\"  ({group_id})\".format(group_id=group_id))\n",
      "    query += \",\\n\".join(cypher_clauses)\n",
      "    query += \"\\nWHERE\\n      \"\n",
      "    query += \"\\n  AND \".join(d['cypher2'])\n",
      "    query += (\"\\nRETURN count(*) AS count, target.id AS id\\n\"\n",
      "                \"ORDER BY count DESC\\n\"\n",
      "                \"LIMIT 1000;\"\n",
      "            )\n",
      "    \n",
      "    \n",
      "    print query\n",
      "    #hydrate the users\n",
      "    #return\n",
      " \n",
      "get_users(\n",
      "    And(\n",
      "        FriendOf('a','b'),FriendOf('c','d'),FriendOf('e','f'),\n",
      "        Or(\n",
      "            FollowerOf('g','h'),FollowerOf('i','j')\n",
      "        )\n",
      "    )\n",
      ")"
     ],
     "language": "python",
     "metadata": {},
     "outputs": [
      {
       "output_type": "stream",
       "stream": "stdout",
       "text": [
        "MATCH (x:User) WHERE x.screen_name IN [\"a\",\"b\"]\n",
        "  WITH collect(id(x)) AS fr0_id\n",
        "\n",
        "MATCH (x:User) WHERE x.screen_name IN [\"c\",\"d\"]\n",
        "  WITH fr0_id, collect(id(x)) AS fr1_id\n",
        "\n",
        "MATCH (x:User) WHERE x.screen_name IN [\"e\",\"f\"]\n",
        "  WITH fr0_id, fr1_id, collect(id(x)) AS fr2_id\n",
        "\n",
        "MATCH (x:User) WHERE x.screen_name IN [\"i\",\"h\",\"j\",\"g\"]\n",
        "  WITH fr0_id, fr1_id, fr2_id, collect(id(x)) AS fo0_id\n",
        "\n",
        "MATCH\n",
        "  (fr0)-[:FOLLOWS]->(target),\n",
        "  (fr1)-[:FOLLOWS]->(target),\n",
        "  (fr2)-[:FOLLOWS]->(target),\n",
        "  (target)-[:FOLLOWS]->(fo0)\n",
        "WHERE\n",
        "      id(fr0) IN fr0_id\n",
        "  AND id(fr1) IN fr1_id\n",
        "  AND id(fr2) IN fr2_id\n",
        "  AND id(fo0) IN fo0_id\n",
        "RETURN count(*) AS count, target.id AS id\n",
        "ORDER BY count DESC\n",
        "LIMIT 1000;\n"
       ]
      }
     ],
     "prompt_number": 466
    },
    {
     "cell_type": "markdown",
     "metadata": {},
     "source": [
      "#testing"
     ]
    }
   ],
   "metadata": {}
  }
 ]
}